Show / Hide Table of Contents
Class PortFinder
Tool used to find a free port for gRPC communication.
Inheritance
System.Object
PortFinder
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Utilities
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public static class PortFinder
Methods
Improve this Doc   View Source
FindPort(Int32, Int32)
Searches for the next available port. startPort Initial port to start the search from.
Declaration
public static int FindPort(int minPort, int maxPort)
Parameters
 Type |  Name |  Description
 System.Int32 |  minPort
 System.Int32 |  maxPort
Returns
 Type |  Description
 System.Int32
 Improve this Doc
 View Source